Revit 2026 API

# SpatialElementFromToCalculationPointsIsAcceptableFromPosition Method

---

Checks whether a given "from" position is valid.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsAcceptableFromPosition(
	XYZ fromPosition
)
```
```vb
Public Function IsAcceptableFromPosition (
	fromPosition As XYZ
) As Boolean
```
```cpp
public:
bool IsAcceptableFromPosition(
	XYZ^ fromPosition
)
```
```fsharp
member IsAcceptableFromPosition :
        fromPosition : XYZ -> bool
```

#### Parameters

fromPosition XYZ

#### Return Value

Boolean True if the input is an acceptable "from" position and False otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The "from" position and the "to" position must be on opposite sides of the family's host. Flipping the calculation point will reverse the direction.

#### Reference

SpatialElementFromToCalculationPoints Class

Autodesk.Revit.DB Namespace